{
  "ascending": {
    "name": "Ascending",
    "description": "You go vertically upwards as your progress throughout the level (stairs, ladders, etc.)."
  },
  "descending": {
    "name": "Descending",
    "description": "You go vertically downwards as your progress throughout the level (stairs, slopes, long drops, waterfalls, etc.)."
  },
  "enemies-await-your-return": {
    "name": "Enemies Await Your Return",
    "description": "Return to a previously explored area to find new enemies to fight (often triggered after finding an essential pickup)."
  },
  "over-the-ceiling": {
    "name": "Over the Ceiling",
    "description": "Revisit the same area and traveling across the ceiling instead. This can include holes. so if you fall back to the floor, you have to make your way to the ceiling again."
  },
  "st-francis-folly": {
    "name": "St. Francis Folly",
    "description": "Explore a series of areas that hold pieces of a puzzle leading up to a final room (e.g. a set of four puzzle holes that open a single door when completed)."
  },
  "swept-by-the-current": {
    "name": "Swept by the Current",
    "description": "The water has a strong current, and falling into the water causes you to lose progress."
  },
  "bigger-on-the-inside": {
    "name": "Bigger On The Inside",
    "description": "Enter a closed section to find out it's much bigger on the inside."
  },
  "mandatory-damage": {
    "name": "Mandatory Damage",
    "description": "The player cannot complete the level without taking some damage to clear a certain section (e.g. a long fall). A medipack might be placed right before such a section."
  },
  "unreachable-pickup": {
    "name": "Unreachable Pickup",
    "description": "There's a fancy looking pickup in plain sight but there's no way to actually reach it."
  },
  "look-at-the-ceiling": {
    "name": "Look at the Ceiling",
    "description": "The hint to progressing is hidden in the ceiling — a clue to a puzzle, a secret crawlspace, etc, and without using the Look button you're unlikely to find it."
  },
  "lose-your-weapons": {
    "name": "Lose Your Weapons",
    "description": "Start the level without your weapons and/or ammo."
  },
  "came-here-by-accident": {
    "name": "Came Here By Accident",
    "description": ""
  },
  "dont-kill-me-just-yet": {
    "name": "Don't Kill Me Just Yet",
    "description": "An enemy triggers something in the level (e.g. open a door to a secret) but they can be killed before having the chance to."
  }
}
